Семена/src/Documents/СборУрожая/СборУрожая.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СборУрожая</name>
  <registerRecords>AccumulationRegister.СобраныйУрожай</registerRecords>
  <attributes>
    <name>Урожай</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборРастений</name>
    <type>
      <types>CatalogRef.НаборыРастений</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Растения</name>
    <attributes>
      <name>Растение</name>
      <type>
        <types>CatalogRef.ВысаженнаяРассада</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Семена/src/AccumulationRegisters/СобраныйУрожай/СобраныйУрожай.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СобраныйУрожай</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сезон</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Растение</name>
    <type>
      <types>CatalogRef.ВысаженнаяРассада</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Семена/src/Documents/СборУрожая/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	ОсталосьВес = Количество;
	ОсталосьРастений = Растения.Количество();
	
	Движения.СобраныйУрожай.Записывать = Истина;
	Для Каждого ТекСтрокаРастения Из Растения Цикл
		Движение = Движения.СобраныйУрожай.Добавить();
		Движение.Сезон = СезонВыращивания;
		Движение.Период = Дата;
		Движение.Растение = ТекСтрокаРастения.Растение;
		Движение.Номенклатура = Урожай;
		
		Если ОсталосьРастений = 1 Тогда 
			Движение.Количество = ОсталосьВес;
		Иначе
			КоличествоНаРастение = ОсталосьВес / ОсталосьРастений;
			Движение.Количество = КоличествоНаРастение;
			ОсталосьВес = ОсталосьВес - Движение.Количество;
			ОсталосьРастений = ОсталосьРастений - 1;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если СезонВыращивания = 0 Тогда
		СезонВыращивания = Константы.ТекущийСезонВыращивания.Получить();
	КонецЕсли;
КонецПроцедуры
